In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in ./anaconda3/lib/python3.7/site-packages (0.3.9)
Requirement already satisfied: ipython>=1.0 in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (7.6.1)
Requirement already satisfied: sqlparse in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: six in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (1.12.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (1.3.5)
Requirement already satisfied: prettytable in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: ipython-genutils>=0.1.0 in ./anaconda3/lib/python3.7/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: pexpect; sys_platform != "win32" in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.7.0)
Requirement already satisfied: setuptools>=18.5 in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (41.0.1)
Requirement already satisfied: pygments in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.4.2)
Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.0.9)
Requirement already satisfied: traitlets>=4.2 in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: jedi>=0.10 in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.13.3)
Requirement already satisfied: backcall in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: appnope; sys_platform == "darwin" in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: decorator in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.4.0)
Requirement already satisfied: pickleshare in ./anaconda3/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: ptyprocess>=0.5 in ./anaconda3/lib/python3.7/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)
Requirement already satisfied: wcwidth in ./anaconda3/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)
Requirement already satisfied: parso>=0.3.0 in ./anaconda3/lib/python3.7/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.5.0)

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in ./anaconda3/lib/python3.7/site-packages (0.9.3)

In [3]:
%load_ext sql

In [8]:
%sql mysql://lmuanons_dba:sql_2020@lmuanonstudent1996.lmu.build/lmuanons_practice

'Connected: lmuanons_dba@lmuanons_practice'

In [12]:
%%sql 

# Print out how many rows of the data is in the CSV data. 

SELECT COUNT(*) 
FROM `TABLE 1`;

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
1 rows affected.

[(25500,)]

In [13]:
%%sql 

/* 
[ANSWER 1] Remove all rows with 'profit' that is not numerical value. Then
print out how many rows of data are left, after removal of the rows with invalid 
non-numeric profit column data. 
*/

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
0 rows affected.

[]

In [14]:
%%sql 

# Firstly... Changing the name of the Profit column

ALTER TABLE `TABLE 1` CHANGE `Profit (in millions)` `Profit` VARCHAR(7) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL;

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
0 rows affected.

[]

In [15]:
%%sql 

DELETE FROM `TABLE 1`
WHERE
    Profit = 'N.A.';

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
369 rows affected.

[]

In [17]:
%%sql

# Checking to see if the non-numerical columns deleted 

SELECT * 
FROM `TABLE 1`
WHERE Profit = 'N.A.';

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
0 rows affected.

[]

In [18]:
%%sql

# Printing how many columns are left 

SELECT COUNT(*) 
FROM `TABLE 1`;

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
1 rows affected.

[(25131,)]

In [19]:
%%sql 

/* 
[ANSWER2] You can now convert the content into JSON format and write it out to another 
file called data2.json which should only contain rows of data that has valid profit values.

Order the data based on the profit value.  Print the top 20 rows with the highest profit 
values.
*/

SELECT * 
FROM `TABLE 1` 
ORDER BY Profit DESC
LIMIT 20;

 * mysql://lmuanons_dba:***@lmuanonstudent1996.lmu.build/lmuanons_practice
20 rows affected.

[(2004, 46, 'Microsoft', Decimal('32187.0'), '9993'),
 (1999, 315, 'Gannett', Decimal('5121.3'), '999.9'),
 (1999, 238, 'KeyCorp', Decimal('7100.0'), '996'),
 (2001, 222, 'St. Paul Travelers Cos.', Decimal('8607.6'), '993.5'),
 (1997, 228, 'PNC Financial Services', Decimal('6333.8'), '992.2'),
 (1969, 54, 'International Paper', Decimal('1561.8'), '99.9'),
 (2003, 318, 'Barnes & Noble', Decimal('5269.3'), '99.9'),
 (2002, 222, 'SCI Systems', Decimal('8713.9'), '99.9'),
 (1980, 149, 'Nabisco Brands', Decimal('2362.0'), '99.8'),
 (1991, 249, 'National Service Industries', Decimal('1647.8'), '99.7'),
 (1994, 346, 'Applied Materials', Decimal('1080.0'), '99.7'),
 (2003, 500, 'Neiman Marcus', Decimal('2948.3'), '99.6'),
 (1979, 141, 'Whirlpool', Decimal('2082.9'), '99.6'),
 (1977, 85, 'General Dynamics', Decimal('2553.5'), '99.6'),
 (1985, 133, 'Combustion Engineering', Decimal('3057.5'), '99.6'),
 (1997, 440, 'Oxford Health Plans', Decimal('3075.0'), '99.6'),
 (1975, 80, 'Burlington Industries Equity', Decimal('2330.0'), '99.5'),
 (2003, 282, 'Interpublic Group', Decimal('6203.6'), '99.5'),
 (1976, 55, 'Ralston Purina', Decimal('3149.1'), '99.5'),
 (1976, 44, 'General Foods', Decimal('3675.1'), '99.4')]

In [ ]:
%%sql 
[Answer 3]

# From there, I decided to export this query as a JSON file. I also exported the JSON file 
# that did not have the non-numeric values.